Enterprise_Serivces/Cert/Bronze1/AllSparkCSRChannel/result1/Iteration1/t3_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/IAllSparkAgentService/RetrievePartnerInventoryThresholds</wsa:Action><wsa:MessageID>uuid:66e1a7cb-fe64-4e27-8570-54d2ba83fcc4</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://allsparkcsrchannelqa1.testgs.pvt/AllSparkAgentService.svc</wsa:To></soap:Header><soap:Body><RetrievePartnerInventoryThresholds xmlns="http://tempuri.org/"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><PartnerKey xmlns="http://www.gamestop.com/CSL/AllSparkChannel/V1.0">TEST-US</PartnerKey></request></RetrievePartnerInventoryThresholds></soap:Body></soap:Envelope>